{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"activity_regularizer": null, "use_bias": true, "kernel_size": [5, 5], "name": "conv2d_1", "batch_input_shape": [null, 1, 28, 28], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "use_bias": true, "kernel_size": [5, 5], "name": "conv2d_2", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "filters": 64, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "activation": "relu", "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.4, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "data_format": "channels_first", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "use_bias": true, "name": "dense_1", "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "use_bias": true, "name": "dense_2", "units": 20, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "use_bias": true, "name": "dense_3", "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}